app/controllers/toys_controller.rb

  def show
    @toy = Toy.find(params[:id])
---
SELECT  "toys".* FROM "toys"  WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @toy = Toy.find(params[:id])
    if (@toy.update(pokemon_id: params[:toy][:pokemon_id]))
---
SELECT  "toys".* FROM "toys"  WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "toys" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "toys"."id" = 1  [["pokemon_id", 9], ["updated_at", "2014-12-22 22:01:29.568710"]]